senserf/picos/PicOS/MSP430/main.c
		for (i = 0; i < n_portmap; i++)
			for (j = 0; j < 8; j++)
				*((portmap [i] . pm_base) + j) =
					portmap [i] . map [j];
		PMAPPWD = 0;
	}
#endif	/* PIN_PORTMAP */

#endif	/* __MSP430_6xx__ */

// ===========================================================================
// ===========================================================================
// ===========================================================================

	// System timer (assumes TASSEL0/TACLR is same as TBSSEL0/TBCLR)
	TCI_CTL = TASSEL0 | TACLR; 	// ACLK source
	_BIS (TCI_CTL, ID0 | ID1);	// divided by 8 = 4096 ticks/sec

	// Select power up and high clock rate
	powerup ();

#if HIGH_CRYSTAL_RATE
	// Was set by powerup, we have to stop it until we actually start
	// the clock
	WATCHDOG_HOLD;
#endif
	// Start it in up mode, interrupts still disabled
	_BIS (TCI_CTL, MC0);
}

void clockdown (void) {

#if HIGH_CRYSTAL_RATE
	// Sorry, the watchdog must be stopped in the slow-clock mode if ACLK
	// is driven by a high-speed crystal
	WATCHDOG_HOLD;
#endif
	TCI_CCR = TCI_INIT_LOW;		// 1, 2, or 16 ticks per second
}

void clockup (void) {

	TCI_CCR = TCI_INIT_HIGH;	// 1024 ticks per second

#if HIGH_CRYSTAL_RATE
	// Resume the watchdog (it is never stopped if ACLK is driven by a
	// low-speed crystal
	WATCHDOG_RESUME;
#endif

}

void powerdown (void) {

	zz_systat.pdmode = 1;
	clockdown ();
#if CRYSTAL2_RATE
	// Disable XTL2
	_BIS (BCSCTL1, XT2OFF);
#endif
}

void powerup (void) {

#if CRYSTAL2_RATE
	// Enable XTL2
	_BIC (BCSCTL1, XT2OFF);
#endif
	clockup ();
	zz_systat.pdmode = 0;
}

void udelay (register word n) {
/* =================================== */
/* n should be roughly in microseconds */
/* =================================== */
	__asm__ __volatile__ (
		"1:\n"
#if CPU_CLOCK_RATE > 2000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 4000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 6000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 7000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 8200
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 9400
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 10600
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 11800
		"nop\n"
#endif
		" dec %[n]\n"
		" jne 1b\n"
			: [n] "+r"(n));
}

void mdelay (word n) {
/* ============ */
/* milliseconds */
/* ============ */
	while (n--)
		udelay (995);
}
/* =============== */
/* Timer interrupt */
/* =============== */
interrupt (TCI_VECTOR) timer_int () {

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 1);
#endif

#if	STACK_GUARD
	if (*(((word*)STACK_END) - 1) != STACK_SENTINEL)
		syserror (ESTACK, "timer_int");
#endif

	// Clear hardware watchdog. Its sole purpose is to guard clock
	// interrupts, while clock interrupts implement a software watchdog.
	WATCHDOG_CLEAR;

	if (TCI_CCR == TCI_INIT_HIGH) {
		// Power up: one tick == 1 JIFFIE
		/* This code assumes that MAX_UTIMERS is 4 */
#define	UTIMS_CASCADE(x) 	if (zz_utims [x]) {\
					 if (*(zz_utims [x]))\
						 (*(zz_utims [x]))--
		UTIMS_CASCADE(0);
		UTIMS_CASCADE(1);
		UTIMS_CASCADE(2);
		UTIMS_CASCADE(3);
		}}}}
#undef UTIMS_CASCADE
		zz_lostk++;

#if	ADC_PRESENT
		// Stub
#endif

		// Extras
#include "irq_timer.h"

		// Run the scheduler at least once every second - to
		// keep the second clock up to date
		if ((zz_lostk >= JIFFIES) ||
		    (zz_mintk && zz_mintk <= zz_lostk)) {

#if WATCHDOG_ENABLED
			if (zz_lostk >= 16 * JIFFIES ) {
				// Software watchdog reset: 16 seconds
#ifdef	WATCHDOG_SAVER
				WATCHDOG_CLEAR;
				WATCHDOG_SAVER ();
#endif
				reset ();
			}
			
#endif	/* WATCHDOG_ENABLED */

			RISE_N_SHINE;
		}

#ifdef	MONITOR_PIN_CLOCK
		_PVS (MONITOR_PIN_CLOCK, 0);
#endif
		RTNI;
	}

	// Here we are running in the SLOW mode: one tick ==
	// JIFFIES/TCI_LOW_PER_SEC

#define	UTIMS_CASCADE(x) \
		if (zz_utims [x]) { \
		  if (*(zz_utims [x])) \
		    *(zz_utims [x]) = *(zz_utims [x]) > \
		      (JIFFIES/TCI_LOW_PER_SEC) ? \
			*(zz_utims [x]) - (JIFFIES/TCI_LOW_PER_SEC) : 0

	UTIMS_CASCADE(0);
	UTIMS_CASCADE(1);
	UTIMS_CASCADE(2);
	UTIMS_CASCADE(3);
	}}}}
#undef UTIMS_CASCADE

	zz_lostk += JIFFIES/TCI_LOW_PER_SEC;

#if TCI_LOW_PER_SEC > 1
	if ((zz_lostk >= JIFFIES) || (zz_mintk && zz_mintk <= zz_lostk))
#endif
	{

#if WATCHDOG_ENABLED
		if (zz_lostk >= 16 * JIFFIES) {
			// Software watchdog reset (16 sec)
#ifdef	WATCHDOG_SAVER
			WATCHDOG_CLEAR;
			WATCHDOG_SAVER ();
#endif
			reset ();
		}
#endif	/* WATCHDOG_ENABLED */

		RISE_N_SHINE;
	}

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 0);
#endif
	RTNI;
}

#if GLACIER
void freeze (word nsec) {
/*
 * Freezes the system in power-down mode for the specified number of seconds.
 */
	byte saveP1IE, saveP2IE;

#if UART_DRIVER || UART_TCV
	word saveUIE;
#endif
	byte saveLEDs;
	word saveLostK;

	// In case some of these take too long for the clock guard
	WATCHDOG_HOLD;

	cli;

	// Save I/O pin interrupt configuration
	saveP1IE = P1IE;
	saveP2IE = P2IE;
	// And disable them
	P1IE = P2IE = 0x00;

	// Save leds status and turn them off
	saveLEDs = leds_save ();
	leds_off ();

#if UART_DRIVER || UART_TCV
	
	// Save and disable UART interrupt configuration
	uart_save_ie_flags (saveUIE);
	uart_a_wait_tx;
#ifdef UART_PREINIT_B
	uart_b_wait_tx;
#endif
#endif
	// We should be OK now
	WATCHDOG_RESUME;

	powerdown ();
	// Save clock state
	saveLostK = zz_lostk;

	while (1) {
		zz_lostk = 0;
		_BIS_SR (LPM3_bits + GIE);
		cli;
		if (nsec == 0)
			break;
		nsec--;
	}

	WATCHDOG_HOLD;

	P1IE = saveP1IE;
	P2IE = saveP2IE;

#if UART_DRIVER || UART_TCV
	// Reset the UART to get it back to normal
	uart_a_reset_on;
	uart_a_reset_off;
#ifdef 	UART_PREINIT_B
	uart_b_reset_on;
	uart_b_reset_off;
#endif
	uart_restore_ie_flags (saveUIE);
#endif
	powerup ();

	// Trigger the interrupts if they are pending
	P1IFG = (P1IE & (P1IES ^ P1IN));
	P2IFG = (P2IE & (P2IES ^ P2IN));

	zz_lostk = saveLostK;

	leds_restore (saveLEDs);

	WATCHDOG_START;
	sti;
}

#endif	/* GLACIER */

static void mem_init () {

	zz_malloc_init ();
}

#if	STACK_GUARD
word zzz_stackfree (void) {

	word sc;
	for (sc = 0; sc < STACK_SIZE / sizeof (word); sc++)
		if (*(((word*)STACK_END) + sc) != STACK_SENTINEL)
			break;
	return sc;
}

#endif

static void ios_init () {

